import { useState } from "react";
import Carousel from "react-bootstrap/Carousel";
import img from "../../assets/banner.jpg";
import "./Carousel.css";
import NewsCard from "../Card";

function ControlledCarousel() {
  const [index, setIndex] = useState(0);

  const handleSelect = (selectedIndex) => {
    setIndex(selectedIndex);
  };
  const article = [
    {
      headline: `పర్మినెంట్‌ సిబ్బంది కుదింపు`,
      img: "https://www.sakshi.com/sites/default/files/styles/storypage_main/public/article_images/2023/11/13/Untitled-4.jpg?itok=HfQfDAr0",
      timespan: "Nov 06,2023 11:05",
      article: ` తాత్కాలిక సిబ్బంది నియామకాలు అంతంతమాత్రం
    లేబర్‌ మార్కెట్‌లో స్తబ్ధత శ్రీ ఎన్‌సిఎఇఆర్‌ సర్వే వెల్లడి
   న్యూఢిల్లీ :   గత 6 నెలల్లో శాశ్వత సిబ్బందిని నియమించుకునే సంస్థలు సగానికి తగ్గాయని, పోనీ తాత్కాలిక నియామకాలు పెరిగాయా అంటే అదీ లేదనినేషనల్‌ కౌన్సిల్‌ ఆఫ్‌ అప్లైడ్‌ ఎకనామిక్‌ రీసెర్చ్‌ (ఎన్‌సిఎఇఆర్‌) సర్వే స్పష్టం చేసింది. ఏప్రిల్‌-జూన్‌ త్రైమాసికంలో శాశ్వత పోస్టులకు రిక్రూట్‌మెంట్‌ను పెంచాలని 30.9 శాతం సంస్థలు యోచించగా, జూలై-సెప్టెంబర్‌ త్రైమాసికంలో ఇటువంటి సంస్థలు15.9 శాతానికి పడిపోయాయి. తాత్కాలిక ఉద్యోగుల నియామకాలు ఈ కాలంలో 45 శాతం నుంచి 35.6 శాతానికి పడిపోయాయని ఎన్‌సిఎఇఆర్‌) తెలిపింది. లేబర్‌ మార్కెట్‌లో సంక్షోభం తీవ్రతను ఇది తెలియజేస్తోంది. వచ్చే 6 నెలల్లో జాబ్‌ మార్కెట్‌ పరిస్థితిలో పెద్దగా మార్పు ఉండకపోవచ్చని విశ్లేషకులు అభిప్రాయపడుతున్నారు. సంఘటిత రంగంలో కొత్త రిక్రూట్‌మెంట్‌కు అవకాశాలు తగ్గిపోయాయి.. 83.9 శాతం సంస్థల్లో పర్మినెంట్‌ పోస్టుల భర్తీ చేసే జాడ ఎక్కడా కనిపించడం లేదు. అక్టోబర్‌లో సేవల రంగ వద్ధి మందగించిందని ఎస్‌అండ్‌పి గ్లోబల్‌ సర్వే ఇదివరకే వెల్లడించింది. అక్టోబరు 31 నాటికి ముగిసిన త్రైమాసికంలో కొత్త ఉద్యోగాల కల్పన కనిష్ట స్థాయికి పడిపోయింది. ఎన్‌సిఎఇఆర్‌ సర్వే ప్రకారం, సెప్టెంబర్‌ త్రైమాసికంలో తాత్కాలిక ఉద్యోగుల సంఖ్యను పెంచాలని యోచిస్తున్న సంస్థలను వేళ్లమీద లెక్కించవచ్చు. ఎన్‌సిఎఇఆర్‌ 126వ రౌండ్‌ సర్వే సెప్టెంబర్‌లో నిర్వహించారు. ఈ పరిశోధనా సంస్థ మొత్తం 500 కంపెనీలను సర్వే చేసింది. నైపుణ్యం కలిగిన కార్మికుల రిక్రూట్‌మెంట్‌ను పెంచడానికి కంపెనీలు పెద్దగా ఆసక్తి చూపడం లేదని సర్వే వెల్లడించింది. ఈ సర్వేపై సిపిఐ(ఎం) ప్రధాన కార్యదర్శి సీతారాం ఏచూరి స్పందిస్తూ, ''కేవలం 3 నెలల్లో, శాశ్వత సిబ్బందిని పెంచుకోవాలని చూస్తున్న కంపెనీలు 30.9 శాతం నుండి 15.9 శాతానికి పడిపోయాయి. తాత్కాలిక ఉద్యోగులను నియమించుకోవాలని చూస్తున్న కంపెనీలు కూడా వెనకడుగు వేస్తున్నాయి. 'మోడినామిక్స్‌' వల్ల ప్రజల ఆదాయాలు దిగజారుతున్నాయి. దీంతో డిమాండ్‌ పడిపోతుంది. అంతిమంగా అది ఆర్థిక వ్యవస్థ కుప్పకూలేందుకు దారి తీస్తుంది'' అని అన్నారు. ప్రధానమంత్రి నరేంద్ర మోదీ వివిధ సందర్భాల్లో భారత దేశ ఆర్థిక వ్యవస్థ భేషుగ్గా ఉందని డాంబికాలు పోతున్నారు. ఆయన చేస్తున్న ప్రకటనలకు, వాస్తవ ఆర్థిక వ్యవస్థ ముఖచిత్రం పూర్తి భిన్నంగా ఉందని ఏచూరి పేర్కొన్నారు. మోదీ చేపట్టిన 'మేక్‌ ఇన్‌ ఇండియా' కార్యక్రమం ఓ ప్రహసనంగా మారిందన్నారు.`,
    },
    {
      headline: `పర్మినెంట్‌ సిబ్బంది కుదింపు`,
      img: "https://www.sakshi.com/sites/default/files/styles/storypage_main/public/article_images/2023/11/13/fruit.jpg?itok=JEDOpuxw",
      timespan: "Nov 06,2023 11:05",
      article: ` తాత్కాలిక సిబ్బంది నియామకాలు అంతంతమాత్రం
    లేబర్‌ మార్కెట్‌లో స్తబ్ధత శ్రీ ఎన్‌సిఎఇఆర్‌ సర్వే వెల్లడి
   న్యూఢిల్లీ :   గత 6 నెలల్లో శాశ్వత సిబ్బందిని నియమించుకునే సంస్థలు సగానికి తగ్గాయని, పోనీ తాత్కాలిక నియామకాలు పెరిగాయా అంటే అదీ లేదనినేషనల్‌ కౌన్సిల్‌ ఆఫ్‌ అప్లైడ్‌ ఎకనామిక్‌ రీసెర్చ్‌ (ఎన్‌సిఎఇఆర్‌) సర్వే స్పష్టం చేసింది. ఏప్రిల్‌-జూన్‌ త్రైమాసికంలో శాశ్వత పోస్టులకు రిక్రూట్‌మెంట్‌ను పెంచాలని 30.9 శాతం సంస్థలు యోచించగా, జూలై-సెప్టెంబర్‌ త్రైమాసికంలో ఇటువంటి సంస్థలు15.9 శాతానికి పడిపోయాయి. తాత్కాలిక ఉద్యోగుల నియామకాలు ఈ కాలంలో 45 శాతం నుంచి 35.6 శాతానికి పడిపోయాయని ఎన్‌సిఎఇఆర్‌) తెలిపింది. లేబర్‌ మార్కెట్‌లో సంక్షోభం తీవ్రతను ఇది తెలియజేస్తోంది. వచ్చే 6 నెలల్లో జాబ్‌ మార్కెట్‌ పరిస్థితిలో పెద్దగా మార్పు ఉండకపోవచ్చని విశ్లేషకులు అభిప్రాయపడుతున్నారు. సంఘటిత రంగంలో కొత్త రిక్రూట్‌మెంట్‌కు అవకాశాలు తగ్గిపోయాయి.. 83.9 శాతం సంస్థల్లో పర్మినెంట్‌ పోస్టుల భర్తీ చేసే జాడ ఎక్కడా కనిపించడం లేదు. అక్టోబర్‌లో సేవల రంగ వద్ధి మందగించిందని ఎస్‌అండ్‌పి గ్లోబల్‌ సర్వే ఇదివరకే వెల్లడించింది. అక్టోబరు 31 నాటికి ముగిసిన త్రైమాసికంలో కొత్త ఉద్యోగాల కల్పన కనిష్ట స్థాయికి పడిపోయింది. ఎన్‌సిఎఇఆర్‌ సర్వే ప్రకారం, సెప్టెంబర్‌ త్రైమాసికంలో తాత్కాలిక ఉద్యోగుల సంఖ్యను పెంచాలని యోచిస్తున్న సంస్థలను వేళ్లమీద లెక్కించవచ్చు. ఎన్‌సిఎఇఆర్‌ 126వ రౌండ్‌ సర్వే సెప్టెంబర్‌లో నిర్వహించారు. ఈ పరిశోధనా సంస్థ మొత్తం 500 కంపెనీలను సర్వే చేసింది. నైపుణ్యం కలిగిన కార్మికుల రిక్రూట్‌మెంట్‌ను పెంచడానికి కంపెనీలు పెద్దగా ఆసక్తి చూపడం లేదని సర్వే వెల్లడించింది. ఈ సర్వేపై సిపిఐ(ఎం) ప్రధాన కార్యదర్శి సీతారాం ఏచూరి స్పందిస్తూ, ''కేవలం 3 నెలల్లో, శాశ్వత సిబ్బందిని పెంచుకోవాలని చూస్తున్న కంపెనీలు 30.9 శాతం నుండి 15.9 శాతానికి పడిపోయాయి. తాత్కాలిక ఉద్యోగులను నియమించుకోవాలని చూస్తున్న కంపెనీలు కూడా వెనకడుగు వేస్తున్నాయి. 'మోడినామిక్స్‌' వల్ల ప్రజల ఆదాయాలు దిగజారుతున్నాయి. దీంతో డిమాండ్‌ పడిపోతుంది. అంతిమంగా అది ఆర్థిక వ్యవస్థ కుప్పకూలేందుకు దారి తీస్తుంది'' అని అన్నారు. ప్రధానమంత్రి నరేంద్ర మోదీ వివిధ సందర్భాల్లో భారత దేశ ఆర్థిక వ్యవస్థ భేషుగ్గా ఉందని డాంబికాలు పోతున్నారు. ఆయన చేస్తున్న ప్రకటనలకు, వాస్తవ ఆర్థిక వ్యవస్థ ముఖచిత్రం పూర్తి భిన్నంగా ఉందని ఏచూరి పేర్కొన్నారు. మోదీ చేపట్టిన 'మేక్‌ ఇన్‌ ఇండియా' కార్యక్రమం ఓ ప్రహసనంగా మారిందన్నారు.`,
    },
    {
      headline: `పర్మినెంట్‌ సిబ్బంది కుదింపు`,
      img: "https://www.sakshi.com/sites/default/files/styles/storypage_main/public/article_images/2023/11/13/applewatch.jpg?itok=6gZ2HD3x",
      timespan: "Nov 06,2023 11:05",
      article: ` తాత్కాలిక సిబ్బంది నియామకాలు అంతంతమాత్రం
    లేబర్‌ మార్కెట్‌లో స్తబ్ధత శ్రీ ఎన్‌సిఎఇఆర్‌ సర్వే వెల్లడి
   న్యూఢిల్లీ :   గత 6 నెలల్లో శాశ్వత సిబ్బందిని నియమించుకునే సంస్థలు సగానికి తగ్గాయని, పోనీ తాత్కాలిక నియామకాలు పెరిగాయా అంటే అదీ లేదనినేషనల్‌ కౌన్సిల్‌ ఆఫ్‌ అప్లైడ్‌ ఎకనామిక్‌ రీసెర్చ్‌ (ఎన్‌సిఎఇఆర్‌) సర్వే స్పష్టం చేసింది. ఏప్రిల్‌-జూన్‌ త్రైమాసికంలో శాశ్వత పోస్టులకు రిక్రూట్‌మెంట్‌ను పెంచాలని 30.9 శాతం సంస్థలు యోచించగా, జూలై-సెప్టెంబర్‌ త్రైమాసికంలో ఇటువంటి సంస్థలు15.9 శాతానికి పడిపోయాయి. తాత్కాలిక ఉద్యోగుల నియామకాలు ఈ కాలంలో 45 శాతం నుంచి 35.6 శాతానికి పడిపోయాయని ఎన్‌సిఎఇఆర్‌) తెలిపింది. లేబర్‌ మార్కెట్‌లో సంక్షోభం తీవ్రతను ఇది తెలియజేస్తోంది. వచ్చే 6 నెలల్లో జాబ్‌ మార్కెట్‌ పరిస్థితిలో పెద్దగా మార్పు ఉండకపోవచ్చని విశ్లేషకులు అభిప్రాయపడుతున్నారు. సంఘటిత రంగంలో కొత్త రిక్రూట్‌మెంట్‌కు అవకాశాలు తగ్గిపోయాయి.. 83.9 శాతం సంస్థల్లో పర్మినెంట్‌ పోస్టుల భర్తీ చేసే జాడ ఎక్కడా కనిపించడం లేదు. అక్టోబర్‌లో సేవల రంగ వద్ధి మందగించిందని ఎస్‌అండ్‌పి గ్లోబల్‌ సర్వే ఇదివరకే వెల్లడించింది. అక్టోబరు 31 నాటికి ముగిసిన త్రైమాసికంలో కొత్త ఉద్యోగాల కల్పన కనిష్ట స్థాయికి పడిపోయింది. ఎన్‌సిఎఇఆర్‌ సర్వే ప్రకారం, సెప్టెంబర్‌ త్రైమాసికంలో తాత్కాలిక ఉద్యోగుల సంఖ్యను పెంచాలని యోచిస్తున్న సంస్థలను వేళ్లమీద లెక్కించవచ్చు. ఎన్‌సిఎఇఆర్‌ 126వ రౌండ్‌ సర్వే సెప్టెంబర్‌లో నిర్వహించారు. ఈ పరిశోధనా సంస్థ మొత్తం 500 కంపెనీలను సర్వే చేసింది. నైపుణ్యం కలిగిన కార్మికుల రిక్రూట్‌మెంట్‌ను పెంచడానికి కంపెనీలు పెద్దగా ఆసక్తి చూపడం లేదని సర్వే వెల్లడించింది. ఈ సర్వేపై సిపిఐ(ఎం) ప్రధాన కార్యదర్శి సీతారాం ఏచూరి స్పందిస్తూ, ''కేవలం 3 నెలల్లో, శాశ్వత సిబ్బందిని పెంచుకోవాలని చూస్తున్న కంపెనీలు 30.9 శాతం నుండి 15.9 శాతానికి పడిపోయాయి. తాత్కాలిక ఉద్యోగులను నియమించుకోవాలని చూస్తున్న కంపెనీలు కూడా వెనకడుగు వేస్తున్నాయి. 'మోడినామిక్స్‌' వల్ల ప్రజల ఆదాయాలు దిగజారుతున్నాయి. దీంతో డిమాండ్‌ పడిపోతుంది. అంతిమంగా అది ఆర్థిక వ్యవస్థ కుప్పకూలేందుకు దారి తీస్తుంది'' అని అన్నారు. ప్రధానమంత్రి నరేంద్ర మోదీ వివిధ సందర్భాల్లో భారత దేశ ఆర్థిక వ్యవస్థ భేషుగ్గా ఉందని డాంబికాలు పోతున్నారు. ఆయన చేస్తున్న ప్రకటనలకు, వాస్తవ ఆర్థిక వ్యవస్థ ముఖచిత్రం పూర్తి భిన్నంగా ఉందని ఏచూరి పేర్కొన్నారు. మోదీ చేపట్టిన 'మేక్‌ ఇన్‌ ఇండియా' కార్యక్రమం ఓ ప్రహసనంగా మారిందన్నారు.`,
    },
  ];
  return (
    <div className="carousel-container">
      <Carousel activeIndex={index} onSelect={handleSelect}>
        <Carousel.Item>
          <div className="newsCard-container">
            <div className="big-card">
              <NewsCard article={article[0]} />
            </div>
          </div>
        </Carousel.Item>
        <Carousel.Item>
          <div className="newsCard-container">
            <div className="big-card">
              <NewsCard article={article[1]} />
            </div>
          </div>
        </Carousel.Item>
        <Carousel.Item>
          <div className="newsCard-container">
            <div className="big-card">
              <NewsCard article={article[2]} />
            </div>
          </div>
        </Carousel.Item>
      </Carousel>
    </div>
  );
}

export default ControlledCarousel;
